Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: ‘Don’t be’, she smiles.
nb: Det skal de ikke være, sier hun.

source: describe and assess their own language learning work
nb: beskrive og vurdere eget arbeid med språklæring

source: Working and business life
nb: Arbeids- og næringsliv

source: Only Geosciences 1 and Geosciences 2 provide complete specialization.
nb: Det er bare geofag 1 og geofag 2 som gir full fordypning.

source: Furthermore, it also involves finding authentic texts from a variety of genres and making use of them.
nb: Det handler videre om å finne fram til autentiske tekster innen ulike sjangere og bruke disse.

source: A great deal of emphasis is placed on storytelling as an oral form of expression in the subject.
nb: I faget legges det stor vekt på fortellingen som muntlig uttrykk.

source: Year 10: The pupil shall receive one grade for coursework. Examination for pupils
nb: Standpunktkarakteren skal være uttrykk for den samlede kompetansen eleven har i matematikk ved avslutningen av opplæringen etter 10. trinn.

source: This is an important finding.
nb: Dette er et viktig funn, mener Sandseter.

source: A discussion can be ended with a conclusion.
nb: Drøftingen kan avsluttes med en konklusjon.

source: The main subject area Socialization deals with socialization in dissimilar cultures and primary and secondary groups and with the role of the mass media in socialization.
nb: dreier seg om sosialisering i ulike kulturer, primær- og sekundærgrupper og om massemedienes rolle i sosialiseringen.

source: describe the role of religion in society from the Middle Ages to the
nb: utforske hvordan mennesker har arbeidet for myndiggjøring og

source: Measures that are appropriate at a company or other
nb: Tiltak som passer i en bedrift eller andre deler av samfunnet,

source: If a child is sick, it is put to bed.
nb: Om noen barn er syke, blir de lagt i en seng.

source: describe and evaluate how language and genres are used by representatives of different professions and in different social settings
nb: beskrive og vurdere hvordan sjangere og språkvarianter i tegnspråk brukes av representanter for ulike grupper og i ulike sosiale sammenhenger

source: involve using digital tools, media and learning resources to obtain and process information, creating and editing different types of text, and communicating with each other.
nb: i norsk for døve og sterkt tunghørte innebærer å åpne for nye læringsarenaer og nye muligheter i lese- og skriveopplæring, i produksjon, komponering og redigering av tekster.

source: To assess means to consider different aspects of an issue or point of view.
nb: Å vurdere er å overveie ulike sider ved et saksforhold eller synspunkt.

source: explain the difference between the terms egocentric and ethnocentric, use these terms to analyse the causes of conflicts between individuals and among groups, and discuss possible solutions to these conflicts
nb: forklare forskjellen på begrepene egosentrisk og etnosentrisk, bruke begrepene til å analysere årsaker til konflikter mellom individer og mellom grupper og diskutere løsninger på konfliktene

source: young people are most often infected within their household, followed by private gatherings or at
nb: Barn og unge har hittil ofte blitt smittet innen egen husstand, deretter på private

source: apply rhetorical and digital skills to produce and present composite texts
nb: bruke retoriske og digitale ferdigheter til å produsere og framføre sammensatte tekster

source: ‘Clear parameters are both an end and a means for preschools.
nb: – Tydelige rammer blir både et mål og et middel for virksomheten.

source: discuss various emotional experiences and reactions and the relationship between physical and mental health
nb: samtale om ulike følelsesmessige opplevelser og reaksjoner og sammenhengen mellom fysisk og psykisk helse

source: how heredity is a precondition for evolution
nb: hvordan arv er en forutsetning for evolusjon

source: They spend almost 40 per cent of their time on things other than being with the children.
nb: De bruker nesten 40 prosent av tiden til andre ting enn samvær med barna.

source: understand and use a vocabulary related to familiar topics
nb: beskrive og fortelle om tema og komposisjon i visuelle uttrykk og sammensatte tekster

source: give an account of religious communities that are represented in their local community and district
nb: diskutere fortellinger om hjelpe- og vokterskikkelser i naturen og sentrale verdispørsmål knyttet til forholdet mellom mennesket og naturen

source: talk about Buddhism and how religious practice is expressed in maxims, rules of conduct, prayer, meditation and holidays
nb: samtale om buddhismen og hvordan religiøs praksis kommer til uttrykk gjennom leveregler, bønner, meditasjon og høytider

source: He turns and leaves the playground.
nb: Han vender seg om og går ut av sandkassa.

source: It is first then, during this pause, that she realises that the bottom of the doll’s pram is being used as a sieve.
nb: Det er først da, i dette stoppet, at hun oppdager at bunnen på dukkevognen brukes som en sil.

source: discuss and elaborate on selected texts from Jewish written traditions
nb: forklare hinduistisk høytidskalender, og beskrive hinduistiske høytider, ritualer og musikk

source: The subject is structured into main subject areas, for which competence aims have been formulated.
nb: Faget er strukturert i hovedområder som det er formulert kompetansemål for.

source: question of whether the pupils are aware of what is needed to
nb: I den forrige dimensjonsanalysen tok vi utgangspunkt i alle sett med variabler som var målt.

source: For that reason, employees must more actively support and promote children’s learning and work with the subject areas in the curriculum’, she adds.
nb: Derfor må de ansatte mer aktivt støtte og fremme barnas læring og jobbe med stoffområdene i læreplanen, mener hun.

source: in Politics, the individual and society involves presenting texts independently, clearly, and in a structured manner.
nb: i politikk, individ og samfunn innebærer å framstille tekster presist, strukturert og selvstendig.

source: The programme subjects shall pave the way for further professional training in landscaping or as a sports facilities operator, or for general studies in agriculture, fishing and forestry.
nb: Programfagene skal legge grunnlaget for videre yrkesutdanning innen anleggsgartnerfaget eller idrettsanleggsfaget, eller for studieforberedende utdanning i naturbruk.

source: interpret, process and assess the mathematical content in various texts
nb: Følg lokale anbefalinger for bruk av munnbind.

source: Regarding the proportion of mathematics teachers who had participated in relevant in-service courses, there is, however, a remarkable similarity between the situation in 3MX and the situation for primary and lower secondary school teachers in mathematics.
nb: Når det gjelder hvor stor andel av matematikklærerne som har deltatt i faglig relevant etter- eller videreutdanning, er det imidlertid en slående likhet mellom situasjonen i 3MX og situasjonen for grunnskolelærere i matematikk.

source: ‘Every year, they advance into a group that is tailored for their particular stage of development’, says Häll.
nb: – De kommer hvert år til et miljø som oppmuntrer dem i den fasen de selv er i utviklingsmessig, sier Häll.

source: recognise Norwegian coins and use them when buying and selling up to the number 100
nb: gjenkjenne norske mynter og sedler opp til 100 og bruke dem i kjøp og salg

source: This subject also concerns understanding the basis for argumentation in current scientific debates.
nb: I hovedområdet inngår muntlig bruk av språket i enkle sammenhenger, tekstforståelse og oversettelse samt poesi og verslære.

source: drama and other creative activities.
nb: utenlandske arrangøren i god tid før eksamen.

source: Competence aims after Vg1 – programmes for general studies / Competence aims after Vg2 – vocational education programmes
nb: Kompetansemål etter Vg1 – studieforberedende utdanningsprogram og Vg2 - yrkesfaglige utdanningsprogram

source: Stimulating critical and reflective participation in society are central elements of the main subject area.
nb: Å stimulere til kritisk og reflektert deltagelse i samfunnet er sentrale elementer i hovedområdet.

source: listen to, systematise and summarise information in spoken texts of varying complexity and reflect on their content
nb: lytte til, systematisere og sammenfatte informasjon i muntlige tekster av ulik kompleksitet og reflektere over innholdet

source: develop and use different arithmetic methods for addition and subtraction of multi-digit numbers in his or her head and on paper
nb: utvikle, bruke og samtale om ulike regnemetoder for addisjon og subtraksjon av flersifrete tall både i hodet og på papiret

source: understand, interpret and compare information from different genres in a composite text
nb: bruke digitale verktøy i produksjon av tegnspråktekster og sammensatte tekster

source: in Social science involves the ability to gather, work with and evaluate figures about topical themes and present these in tables, graphs, figures and diagrams.
nb: i samfunnsfag innebærer å hente inn, arbeide med og vurdere talltilfang om faglige tema, og å framstille dette i tabeller, grafer og figurer.

source: apply knowledge of rhetorical appeals in presentations
nb: anvende kunnskap om språk og tekst i samtale på norsk eller tegnspråk om egenopplevd litteratur

source: The teaching in Politics, the individual and society shall pave the way for the use of varied learning venues and learning strategies.
nb: Opplæringen i politikk, individ og samfunn skal åpne for bruk av varierte læringsarenaer og læringsstrategier.

source: Furthermore, the main subject area deals with how norms for production and assessment of texts is developed and altered in various text cultures.
nb: Hovedområdet omfatter hvordan normer for produksjon og vurdering av tekster utvikles og forandres i forskjellige tekstkulturer.

source: Also included are critical assessment and the use of sources.
nb: Det dreier seg også om kritisk vurdering og bruk av kilder.

source: listen to others, express and give rationales for one's own points of view and show respect for the ideas of others
nb: lytte til og forstå andre, uttrykke og grunngi sine egne standpunkter og vise respekt for andres

source: These skills are important tools in working on understanding and using English in increasingly varied and demanding contexts across cultures and subject fields.
nb: Disse ferdighetene er viktige redskaper i arbeidet med å forstå og ta i bruk engelsk i stadig mer varierte og krevende sammenhenger på tvers av kulturer og fagfelt.

source: It also involves the measurement and evaluation of chemical and physical environmental parameters, the fish’s health and practice hygiene work.
nb: Videre dreier det seg om måling og vurdering av kjemiske og fysiske miljøparametere, fiskehelse og praktisk hygienearbeid.

source: (Section 1-2 of the Education Act and the Core Curriculum)
nb: (Oppl.l. § 1-2 og læreplanverkets generelle del)

source: Geography and History are continued as common core subjects in the programme for general studies.
nb: Geografi og historie føres videre som fellesfag i de studieforberedende utdanningsprogrammene.

source: radiation and radioactivity,
nb: stråling og radioaktivitet

source: To present may also mean to illustrate and to demonstrate.
nb: Presentere kan også bety å illustrere og å demonstrere.

source: express their thoughts on texts from different periods and cultures
nb: uttrykke tanker om tekster fra ulike tider og kulturer

source: expressions and numbers and use the equals/does not equal signs
nb: uttrykk og tall og bruke likhets- og ulikhetstegn

source: Education in the subject shall develop the theoretical and practical competence to analyse and compare religions, views on life and philosophical disciplines.
nb: Opplæringen i faget skal utvikle teoretisk og praktisk kompetanse til å analysere og sammenligne religioner, livssyn og filosofiske retninger.

source: in KRLE involves experiencing and understanding written texts.
nb: i KRLE innebærer å oppleve og forstå tekster.

source: The teacher provides guidance on further learning and adapts the education to enable the pupils to use the guidance to develop competence in practical problem solving, creative processes, visual communication, and reflection on visual and material cultures.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i praktisk problemløsning, kreative prosesser, visuell kommunikasjon og refleksjon over visuell og materiell kultur.

source: in Mathematics involves the use of symbolic language, mathematical concepts, methods of approach and varied strategies to solve problems and explore mathematics by taking a point of departure in practical day-to-day situations and mathematical problems.
nb: i matematikk innebærer å bruke symbolspråk, matematiske begreper, framgangsmåter og varierte strategier til problemløsning og utforskning som tar utgangspunkt både i praktiske, dagligdagse situasjoner og i matematiske problemer.

source: Developing reading skills in English also improves general reading skills.
nb: Å utvikle leseferdighet på engelsk vil også bidra til å styrke leseferdigheten generelt.

source: , comments one preschool teacher.
nb: , sier en barnehagelærer.

source: plan, implement, document and evaluate optimal operations based on the biology of the farmed species
nb: planlegge, gjennomføre, dokumentere og vurdere optimal drift ut fra de aktuelle oppdrettsartenes biologi

source: calculate and elaborate on measures of central tendency and measures of spread
nb: berekne kumulativ frekvens og finne og drøfte sentralmål og spreiingsmål

source: Teaching periods are given in 60-minute units:
nb: Timetall er oppgitt i 60-minutters enheter:

source: The main subject area includes the phenomena tradition, modernity and postmodernity.
nb: Hovedområdet omfatter fenomenene tradisjon, modernitet og postmodernitet.

source: which expresses its focus.
nb: som uttrykk for vektlegging innenfor hovedområdet.

source: How do the national cases understand the user perspective and how is this
nb: eksisterende webside til å nå ut med informasjon til pårørende og medier.

source: The researchers were also told of playhouses that had been removed for fear children would fall from the roof.
nb: Forskerne fikk også høre om lekehytter som er tatt bort fordi man er redd for at barn kan ramle ned fra taket.

source: describe some of the characteristics of common vernaculars in Norway and discuss attitudes towards different vernaculars
nb: beskrive og fortelle om tema og komposisjon i visuelle uttrykk og sammensatte tekster

source: talk about the content of the Ten Commandments, the Lord's Prayer, the Apostolic Faith and some songs and Psalms
nb: samtale om innholdet i de ti bud, Fadervår, den apostoliske trosbekjennelse og noen sang- og salmetekster

source: A debate among several persons on a subject can mean the same as to discuss.
nb: Å utforske kan også bety å teste eller prøve ut og evaluere arbeidsmetoder, produkter eller utstyr.

source: Competence aims after Year 7
nb: Kompetansemål etter 7.

source: retell simple texts from Sign Language to Norwegian and from Norwegian to Sign Language
nb: beskrive likheter og forskjeller mellom døvekultur og norsk kultur før og nå

source: language, culture and society
nb: kultur, samfunn og litteratur

source: Detailed information removed on symptoms, the virus and illness, when students can attend school, flowchart for dealing with sick individuals at school, risk groups.
nb: Tiltakene varierer fra tilnærmet normal organisering av skolehverdagen (grønt nivå), til omfattende tiltak med mindre, faste grupper og større avstand mellom elever og ansatte (rødt nivå).

source: in kindergarten involves one child sitting in front of a computer, drawing or playing games, while a group of other children stand around, watching.
nb: i barnehagen dreier seg om at ett barn sitter foran en datamaskin og tegner og spiller spill, mens en flokk andre barn står rundt og ser på.

source: In the Mathematics X programme subject, basic skills are understood as follows:
nb: I matematikk X forstås grunnleggende ferdigheter slik:

source: That made it hard for them to climb up and down on the chairs themselves.
nb: Dette gjorde det vanskeligere for dem å klatre opp i stolen selv.

source: Thus, flexibility and individual and local adaptation are key elements in the organization of the teaching.
nb: Fleksibilitet, individuell og lokal tilpasning er følgelig sentrale elementer i organiseringen av opplæringen.

source: is intended as information and as a basis for discussion about practice in the individual school.
nb: vurdering i opplæringa har Utdanningsdirektoratet utarbeidd en brosjyre om undervegsvurdering i fag.

source: understand and make use of key words and expressions to cover basic needs at school and during their leisure time
nb: forstå og bruke sentrale ord og uttrykk for å dekke grunnleggende behov i skolen og i fritiden

source: give an account of and use different linguistic and aesthetic devices in fiction and creative texts and explain their function
nb: beskrive estetiske uttrykk i teater, film, musikkvideo, aviser og reklame, og drøfte ulike funksjoner knyttet til språk og bilde

source: Strictly speaking, we should not use expressions like ‘23% of the teachers in 3MX’, but rather ‘teachers of 23% of the students in 3MX’.
nb: Derfor burde vi strengt tatt ikke bruke formuleringer av typen ”23 % av lærerne i 3MX”, men heller ”lærerne til 23 % av elevene i 3MX”.

source: But the staff is loyal to the system and uses the tools anyway.
nb: Men de barnehageansatte er ­samtidig lojale mot systemet og ­bruker kartleggingsverktøyene ­likevel.

source: Teaching in the subject shall use varied and absorbing working methods, which can contribute to understanding in all aspects of the subject.
nb: Aktiviteter som fortelling, forming, dramatisering, sang og musikk, samtaler og besøk skal bidra til å engasjere elevene og gi innsikt i ulike religioner og livssyn.

source: Probability and statistics
nb: Sannsynlighet og statistikk

source: It also involves being able to process and use information from images, films, drawings, diagrams, tables and charts, and searching for information in a purposeful manner using critical assessment, being aware of one’s choices and being able to select and eliminate sources of information.
nb: Det innebærer også å kunne behandle og bruke informasjon fra bilder, film, tegninger, grafer, tabeller og kart, og å gjøre målrettet informasjonssøk, kritisk vurdering og bevisste valg og bortvalg av kilder.

source: write social science texts with precise use of terminology, provide the reasoning and grounds for one’s conclusions and refer to sources
nb: skrive samfunnsfaglige tekster med presis bruk av fagbegreper, begrunnede konklusjoner og kildehenvisninger

source: philosophy, ethics and views on life/humanism
nb: filosofi, etikk og livssynshumanisme

source: Culture and modelling
nb: Kultur og modellering

source: It means understanding mathematical symbols and logical reasoning.
nb: Det betyr å forstå matematiske symboluttrykk og logiske resonnementer.

source: use variables and formulas to express relationships in practical
nb: bruke variabler og formler til å uttrykke sammenhenger i praktiske

source: cite theories of the causes of substance abuse, and use these theories to explain how substance abuse can be prevented and treated
nb: gjengi teorier om årsaker til rusmiddelmisbruk og bruke teoriene til å vurdere hvordan rusmiddelmisbruk kan forebygges og behandles

source: The dividing line between supporting each other and excluding others can be razor thin.
nb: Men grensen mellom å støtte hverandre og å ekskludere andre kan være hårfin.

source: explain how el Niño and la Niña arise, and describe their influence on the climate
nb: forklare hvordan el Niño og la Niña oppstår, og beskrive innvirkning på klimaet

source: The teacher makes it clear that he is rather uncertain about whether he is doing the right thing, what the potential consequences may be, and how he should respond.
nb: Barnehagelæreren gir uttrykk for at han er litt usikker på om han handler rett, hvilke konsekvenser han kan se for seg, og på hvordan han skal reagere.

source: Basic skills in Norwegian Sign Language are as follows:
nb: I norsk tegnspråk forstås grunnleggende ferdigheter slik

source: describe the mosque, reflect on its significance and use, and use digital tools to search for information and make presentations about this
nb: beskrive moskeen og reflektere over dens betydning og bruk og nytte digitale verktøy til å søke informasjon og lage presentasjoner

source: Loading and transporting are included in the main subject area.
nb: Lasting og transport inngår i hovedområdet.

source: In addition, it’s difficult to define what a meaningful and good life is for children in a kindergarten.
nb: Det er også vanskelig å definere hva som er et meningsfullt og verdig liv for barnehagebarn.

source: explain the Jewish calendar and manner of calculating historic time, and describe Jewish holidays, festivals and central rituals
nb: forklare jødisk kalender og tidsregning, og beskrive jødiske høytider, ritualer og musikk

source: By conjoining knowledge about history and philosophy with skills in historical thinking and philosophical reflection, the programme subject History and philosophy can give rise to new perspectives on people in history and history in people.
nb: Ved å binde sammen kunnskaper om historie og filosofi med ferdigheter i historisk tenkning og filosofisk refleksjon kan programfaget historie og filosofi åpne for nye perspektiver på mennesket i historien og historien i mennesket.

source: After Level Vg1 general study programmes and Level Vg2 vocational study programmes
nb: Etter Vg1studieforberedende program og Vg2 yrkesfaglige utdanningsprogram

source: technology and design
nb: teknologi og design

source: The main subject area encompasses individualization, group formation and globalization.
nb: Hovedområdet omfatter individualisering, gruppedannelse og globalisering.

source: recognise Hindu art and make use of aesthetic expressions related to Hinduism
nb: gjenkjenne kunst og gjøre bruk av estetiske uttrykk knyttet til hinduismen

source: elaborate on causes of unemployment and discuss ways of reducing unemployment
nb: diskutere muligheter og utfordringer for sysselsetting og verdiskaping i samisk næringsliv og samfunn og drøfte arbeidsledighet

source: read formal and informal texts from various genres and with different purposes
nb: beherske ulike skriverroller som finnes i skolens offentlighet og i samfunns- og arbeidsliv

source: select an in-depth study topic within his/her own education programme and present this to the other pupils
nb: vurdere forskjellige kilder og bruke innhold fra kildene på en selvstendig, kritisk og etterprøvbar måte

source: carry out relevant weather measurements and present the results with and without digital aids
nb: observere værtegn i naturen og foreta relevante værmålinger og presentere resultatene med og uten digitale hjelpemidler

source: But if one has a closer look, there might be children who always are given a role out of sight,” Söderström tells.
nb: Men ser man ­tydeligere etter, kan det være noen barn som hele tiden tildeles rollen som ­bortgjemt, forklarer Söderström.

source: Competence aims after 1T-Y - Vg1 vocational education programme
nb: Kompetansemål etter 1T-Y – Vg1 yrkesfaglige utdanningsprogram
